UserHackable/Phototherapy_Timer/esp32_firmware/apps/session_timer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# LAN NTP + public fallbacks (session_timer SNTP_SERVER_*)
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Dual OTA on 4MB (see esp32_firmware/partitions/partitions_two_ota_4mb.csv).
# First flash after this change must be full USB flash (partition table).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions/partitions_two_ota_4mb.csv"
# LAN OTA uses HTTP + SHA-256 (not public internet).
CONFIG_OTA_ALLOW_HTTP=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
# Roll back if new app does not mark itself valid after boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
